# Êï∞ÊçÆÁºñÁ†ÅÁöÑÂçÅÁßçÊñπÂºè


```{admonition} Âú®Á∫øÂà∑È¢ò
:class: seealso

Ê£ÄÊü• or Âº∫Âåñ `Pandas` Êï∞ÊçÆÂàÜÊûêÊìç‰ΩúÔºü<a href="https://www.heywhale.com/mw/project/6146c0318447b8001769ff20" target="_blank">üëâÂú®Á∫ø‰ΩìÈ™å„ÄåPandasËøõÈò∂‰øÆÁÇº300È¢ò„Äç</a>
```

```{note} 
Êú¨È°µÈù¢‰ª£Á†ÅÂèØ‰ª•[Âú®Á∫øÁºñËæë„ÄÅÊâßË°å](../ÊåáÂºï/Âú®Á∫øÊâßË°å.md)ÔºÅ
```

Âú®‰ΩøÁî®`Python`ËøõË°åÊú∫Âô®Â≠¶‰π†Êó∂ÔºåÂæàÂ§öÁÆóÊ≥ïÈÉΩÈúÄË¶ÅÊàë‰ª¨ÂØπÂàÜÁ±ªÁâπÂæÅËøõË°åËΩ¨Êç¢ÔºàÁºñÁ†ÅÔºâÔºåÂç≥Ê†πÊçÆÊüê‰∏ÄÂàóÁöÑÂÄºÔºåÊñ∞Â¢ûÔºà‰øÆÊîπÔºâ‰∏ÄÂàó„ÄÇ

Ëøô‰∏™Êìç‰ΩúÂú®`pandas`‰∏≠‰πüÊúâÂ§öÁßçËß£ÂÜ≥ÊñπÊ°àÔºåÊú¨ÊñáÂ∞±Â∞Ü‰ªãÁªçÂçÅÁßçÊñπÊ≥ïÔºå‰ª£Á†ÅÊãøËµ∞Â∞±Áî®ÔºåÂ∏åÊúõ‰Ω†Âú®ÈÅáÂà∞‰∏çÂêåÁ±ªÂûãÁöÑÊï∞ÊçÆÊó∂ÔºåÂèØ‰ª•ÁÅµÊ¥ª‰ΩøÁî®„ÄÇ
  
‰∏ãÈù¢ÂÖàÂàõÂª∫Áî®‰∫éÁ§∫‰æãÁöÑÊï∞ÊçÆüëá

In [1]:
import sklearn
sklearn.__version__

'1.0.2'

In [152]:
import pandas as pd
df = pd.DataFrame({
    "Sex": pd.Series(['Male','Female','Male','Male','Male','Female','Male','Male','Female','Female']),
    "Course Name": pd.Series(['Python','Java','C','Sql','Linux','Python','Python','Java','C','Php']),
    "Score":[95,85,75,65,55,95,75,65,55,85]})

df

      Sex Course Name  Score
0    Male      Python     95
1  Female        Java     85
2    Male           C     75
3    Male         Sql     65
4    Male       Linux     55
5  Female      Python     95
6    Male      Python     75
7    Male        Java     65
8  Female           C     55
9  Female         Php     85

## Êï∞ÂÄºÂûãÊï∞ÊçÆÁºñÁ†Å

### 1 - ‰ΩøÁî®Ëá™ÂÆö‰πâÂáΩÊï∞ + Âæ™ÁéØÈÅçÂéÜ

È¶ñÂÖàÁÑ∂ÊòØÊúÄÁÆÄÂçïÔºåÊúÄÁ¨®ÁöÑÊñπÊ≥ïÔºåËá™Â∑±ÂÜô‰∏Ä‰∏™ÂáΩÊï∞Êù•ËΩ¨Êç¢Êï∞ÊçÆÔºåÂπ∂Áî®Âæ™ÁéØÈÅçÂéÜÔºåËÇØÂÆöÂ∞±ÊòØ‰∏Ä‰∏™`def`Âä†‰∏Ä‰∏™`for`

In [153]:
df1 = df.copy()

def myfun(x):
    if x>90:
        return 'A'
    elif x>=80 and x<90:
        return 'B'
    elif x>=70 and x<80:
        return 'C'
    elif x>=60 and x<70:
        return 'D'
    else:
        return 'E'
    
df1['Score_Label'] = None
for i in range(len(df1)):
    df1.iloc[i,3] = myfun(df1.iloc[i,2])
    
df1

      Sex Course Name  Score Score_Label
0    Male      Python     95           A
1  Female        Java     85           B
2    Male           C     75           C
3    Male         Sql     65           D
4    Male       Linux     55           E
5  Female      Python     95           A
6    Male      Python     75           C
7    Male        Java     65           D
8  Female           C     55           E
9  Female         Php     85           B

ËøôÊÆµ‰ª£Á†ÅÔºåÁõ∏‰ø°ÊâÄÊúâ‰∫∫ÈÉΩËÉΩÁúãÊáÇÔºåÁÆÄÂçïÂ•ΩÊÉ≥‰ΩÜÊØîËæÉÈ∫ªÁÉ¶

ÊúâÊ≤°ÊúâÊõ¥ÁÆÄÂçïÁöÑÂäûÊ≥ïÂë¢Ôºü`pandas`ÂΩìÁÑ∂Êèê‰æõ‰∫ÜÂæàÂ§öÈ´òÊïàÁöÑÊìç‰ΩúÁöÑÂáΩÊï∞ÔºåÁªßÁª≠ÂæÄ‰∏ãÁúã„ÄÇ

### 2 - ‰ΩøÁî® map + Ëá™ÂÆö‰πâÂáΩÊï∞

Áé∞Âú®ÔºåÂèØ‰ª•‰ΩøÁî®`map`Êù•Âπ≤ÊéâÂæ™ÁéØÔºàËôΩÁÑ∂Êú¨Ë¥®‰∏ä‰πüÊòØÂæ™ÁéØÔºâ

In [154]:
df2 = df.copy()

def mapfun(x):
    if x>90:
        return 'A'
    elif x>=80 and x<90:
        return 'B'
    elif x>=70 and x<80:
        return 'C'
    elif x>=60 and x<70:
        return 'D'
    else:
        return 'E'

df2['Score_Label'] = df2['Score'].map(mapfun)
df2

      Sex Course Name  Score Score_Label
0    Male      Python     95           A
1  Female        Java     85           B
2    Male           C     75           C
3    Male         Sql     65           D
4    Male       Linux     55           E
5  Female      Python     95           A
6    Male      Python     75           C
7    Male        Java     65           D
8  Female           C     55           E
9  Female         Php     85           B

### 3 - ‰ΩøÁî® apply + ÂåøÂêçÂáΩÊï∞

Â¶ÇÊûúËøòÊÉ≥ÁÆÄÊ¥Å‰ª£Á†ÅÔºåÂèØ‰ª•‰ΩøÁî®`Ëá™ÂÆö‰πâÂáΩÊï∞ + apply`Êù•Âπ≤ÊéâËá™ÂÆö‰πâÂáΩÊï∞(ÁªìÊûúÂíå‰∏äÈù¢ÊòØ‰∏ÄËá¥ÁöÑÔºåÂè™‰∏çËøáËøô‰πàÂÜôÂÆπÊòìË¢´Êâì„ÄÇ)

In [184]:
df3 = df.copy()
df3['Score_Label'] = df3['Score'].apply(lambda x: 'A' if x > 90 else (
    'B' if 90 > x >= 80 else ('C' if 80 > x >= 70 else ('D' if 70 > x >= 60 else 'E'))))
df3

      Sex Course Name  Score Score_Label
0    Male      Python     95           A
1  Female        Java     85           B
2    Male           C     75           C
3    Male         Sql     65           D
4    Male       Linux     55           E
5  Female      Python     95           A
6    Male      Python     75           C
7    Male        Java     65           D
8  Female           C     55           E
9  Female         Php     85           B

### 4 - ‰ΩøÁî®cut

Áé∞Âú®ÔºåËÆ©Êàë‰ª¨ÁªßÁª≠‰∫ÜËß£Êõ¥È´òÁ∫ßÁöÑ`pandas`ÂáΩÊï∞Ôºå‰æùÊóßÊòØÂØπ `Score` ËøõË°åÁºñÁ†ÅÔºå‰ΩøÁî®`pd.cut`ÔºåÂπ∂ÊåáÂÆöÂàíÂàÜÁöÑÂå∫Èó¥ÂêéÔºåÂèØ‰ª•Áõ¥Êé•Â∏Æ‰Ω†ÂàÜÂ•ΩÁªÑ

In [156]:
df4 = df.copy()
bins = [0, 59, 70, 80, 100]
df4['Score_Label'] = pd.cut(df4['Score'], bins)
df4

      Sex Course Name  Score Score_Label
0    Male      Python     95   (80, 100]
1  Female        Java     85   (80, 100]
2    Male           C     75    (70, 80]
3    Male         Sql     65    (59, 70]
4    Male       Linux     55     (0, 59]
5  Female      Python     95   (80, 100]
6    Male      Python     75    (70, 80]
7    Male        Java     65    (59, 70]
8  Female           C     55     (0, 59]
9  Female         Php     85   (80, 100]

‰πüÂèØ‰ª•Áõ¥Êé•‰ΩøÁî®`labels`ÂèÇÊï∞Êù•‰øÆÊîπÂØπÂ∫îÁªÑÁöÑÂêçÁß∞ÔºåÊòØ‰∏çÊòØÊñπ‰æøÂ§ö‰∫Ü

In [157]:
df4['Score_Label_new'] = pd.cut(df4['Score'], bins, labels=[
                                'low', 'middle', 'good', 'perfect'])
df4

      Sex Course Name  Score Score_Label Score_Label_new
0    Male      Python     95   (80, 100]         perfect
1  Female        Java     85   (80, 100]         perfect
2    Male           C     75    (70, 80]            good
3    Male         Sql     65    (59, 70]          middle
4    Male       Linux     55     (0, 59]             low
5  Female      Python     95   (80, 100]         perfect
6    Male      Python     75    (70, 80]            good
7    Male        Java     65    (59, 70]          middle
8  Female           C     55     (0, 59]             low
9  Female         Php     85   (80, 100]         perfect

### 5 - ‰ΩøÁî® sklearn ‰∫åÂÄºÂåñ

Êó¢ÁÑ∂ÊòØÂíåÊú∫Âô®Â≠¶‰π†Áõ∏ÂÖ≥Ôºå`sklearn`ËÇØÂÆöË∑ë‰∏çÊéâÔºåÂ¶ÇÊûúÈúÄË¶ÅÊñ∞Â¢û‰∏ÄÂàóÂπ∂Âà§ÂÆöÊàêÁª©ÊòØÂê¶ÂèäÊ†ºÔºåÂ∞±ÂèØ‰ª•‰ΩøÁî®`Binarizer`ÂáΩÊï∞Ôºå‰ª£Á†Å‰πüÊòØÁÆÄÊ¥ÅÂ•ΩÊáÇ

In [158]:
from sklearn.preprocessing import Binarizer

df5 = df.copy()
binerize = Binarizer(threshold = 60)
trans = binerize.fit_transform(np.array(df1['Score']).reshape(-1,1))
df5['Score_Label'] = trans

df5

      Sex Course Name  Score  Score_Label
0    Male      Python     95            1
1  Female        Java     85            1
2    Male           C     75            1
3    Male         Sql     65            1
4    Male       Linux     55            0
5  Female      Python     95            1
6    Male      Python     75            1
7    Male        Java     65            1
8  Female           C     55            0
9  Female         Php     85            1

## ÊñáÊú¨ÂûãÊï∞ÊçÆÁºñÁ†Å

‰∏ãÈù¢‰ªãÁªçÊõ¥Â∏∏ËßÅÁöÑÔºåÂØπÊñáÊú¨Êï∞ÊçÆËøõË°åËΩ¨Êç¢ÊâìÊ†áÁ≠æ„ÄÇ‰æãÂ¶ÇÊñ∞Â¢û‰∏ÄÂàóÔºåÂ∞ÜÊÄßÂà´Áî∑„ÄÅÂ•≥ÂàÜÂà´Ê†áËÆ∞‰∏∫0„ÄÅ1

### 6 - ‰ΩøÁî® replace

È¶ñÂÖà‰ªãÁªç`replace`Ôºå‰ΩÜË¶ÅÊ≥®ÊÑèÁöÑÊòØÔºå‰∏äÈù¢ËØ¥ËøáÁöÑËá™ÂÆö‰πâÂáΩÊï∞Áõ∏ÂÖ≥ÊñπÊ≥ï‰æùÊóßÊòØÂèØË°åÁöÑ

In [160]:
df6 = df.copy()
df6['Sex_Label'] = df6['Sex'].replace(['Male','Female'],[0,1])
df6

      Sex Course Name  Score  Sex_Label
0    Male      Python     95          0
1  Female        Java     85          1
2    Male           C     75          0
3    Male         Sql     65          0
4    Male       Linux     55          0
5  Female      Python     95          1
6    Male      Python     75          0
7    Male        Java     65          0
8  Female           C     55          1
9  Female         Php     85          1

‰∏äÈù¢ÊòØÂØπÊÄßÂà´Êìç‰ΩúÔºåÂõ†‰∏∫Âè™ÊúâÁî∑Â•≥ÔºåÊâÄ‰ª•ÂèØ‰ª•ÊâãÂä®ÊåáÂÆö0„ÄÅ1Ôºå‰ΩÜË¶ÅÊòØÁ±ªÂà´ÂæàÂ§öÔºå‰πüÂèØ‰ª•‰ΩøÁî®`pd.value_counts()`Êù•Ëá™Âä®ÊåáÂÆöÊ†áÁ≠æÔºå‰æãÂ¶ÇÂØπ`Course Name`ÂàóÂàÜÁªÑ

In [161]:
df6 = df.copy()
value = df6['Course Name'].value_counts()
value_map = dict((v, i) for i,v in enumerate(value.index))
df6['Course Name_Label'] = df6.replace({'Course Name':value_map})['Course Name']
df6

      Sex Course Name  Score  Course Name_Label
0    Male      Python     95                  0
1  Female        Java     85                  1
2    Male           C     75                  2
3    Male         Sql     65                  5
4    Male       Linux     55                  3
5  Female      Python     95                  0
6    Male      Python     75                  0
7    Male        Java     65                  1
8  Female           C     55                  2
9  Female         Php     85                  4

### 7 - ‰ΩøÁî®map

È¢ùÂ§ñÂº∫Ë∞ÉÁöÑÊòØÔºåÊñ∞Â¢û‰∏ÄÂàóÔºå‰∏ÄÂÆöË¶ÅËÉΩÂ§üÊÉ≥Âà∞`map`

In [162]:
df7 = df.copy()
Map = {elem:index for index,elem in enumerate(set(df["Course Name"]))}
df7['Course Name_Label'] = df7['Course Name'].map(Map)
df7

      Sex Course Name  Score  Course Name_Label
0    Male      Python     95                  5
1  Female        Java     85                  2
2    Male           C     75                  0
3    Male         Sql     65                  3
4    Male       Linux     55                  1
5  Female      Python     95                  5
6    Male      Python     75                  5
7    Male        Java     65                  2
8  Female           C     55                  0
9  Female         Php     85                  4

### 8 - ‰ΩøÁî®astype

Ëøô‰∏™ÊñπÊ≥ïÂ∫îËØ•ÂæàÂ§ö‰∫∫‰∏çÁü•ÈÅìÔºåËøôÂ∞±Â±û‰∫é‰∏äÈù¢ÊèêÂà∞ÁöÑÁü•‰πéÈóÆÈ¢òÔºåËÉΩÂÆûÁé∞ÁöÑÊñπÊ≥ïÂ§™Â§ö‰∫Ü

In [163]:
df8 = df.copy()
value = df8['Course Name'].astype('category')
df8['Course Name_Label'] = value.cat.codes
df8

      Sex Course Name  Score  Course Name_Label
0    Male      Python     95                  4
1  Female        Java     85                  1
2    Male           C     75                  0
3    Male         Sql     65                  5
4    Male       Linux     55                  2
5  Female      Python     95                  4
6    Male      Python     75                  4
7    Male        Java     65                  1
8  Female           C     55                  0
9  Female         Php     85                  3

### 9 - ‰ΩøÁî® sklearn

ÂêåÊï∞ÂÄºÂûã‰∏ÄÊ†∑ÔºåËøôÁßçÊú∫Âô®Â≠¶‰π†‰∏≠ÁöÑÁªèÂÖ∏Êìç‰ΩúÔºå`sklearn`‰∏ÄÂÆöÊúâÂäûÊ≥ïÔºå‰ΩøÁî®`LabelEncoder`ÂèØ‰ª•ÂØπÂàÜÁ±ªÊï∞ÊçÆËøõË°åÁºñÁ†Å

In [164]:
from sklearn.preprocessing import LabelEncoder
df9 = df.copy()
le = LabelEncoder()
le.fit(df9['Sex'])
df9['Sex_Label'] = le.transform(df9['Sex'])
le.fit(df9['Course Name'])
df9['Course Name_Label'] = le.transform(df9['Course Name'])
df9

      Sex Course Name  Score  Sex_Label  Course Name_Label
0    Male      Python     95          1                  4
1  Female        Java     85          0                  1
2    Male           C     75          1                  0
3    Male         Sql     65          1                  5
4    Male       Linux     55          1                  2
5  Female      Python     95          0                  4
6    Male      Python     75          1                  4
7    Male        Java     65          1                  1
8  Female           C     55          0                  0
9  Female         Php     85          0                  3

‰∏ÄÊ¨°ÊÄßËΩ¨Êç¢‰∏§Âàó‰πüÊòØÂèØ‰ª•ÁöÑ

In [165]:
from sklearn.preprocessing import LabelEncoder
df9 = df.copy()
le = OrdinalEncoder()
le.fit(df9[['Sex','Course Name']])
df9[['Sex_Label','Course Name_Label']] = le.transform(df9[['Sex','Course Name']])

df9

      Sex Course Name  Score  Sex_Label  Course Name_Label
0    Male      Python     95        1.0                4.0
1  Female        Java     85        0.0                1.0
2    Male           C     75        1.0                0.0
3    Male         Sql     65        1.0                5.0
4    Male       Linux     55        1.0                2.0
5  Female      Python     95        0.0                4.0
6    Male      Python     75        1.0                4.0
7    Male        Java     65        1.0                1.0
8  Female           C     55        0.0                0.0
9  Female         Php     85        0.0                3.0

### 10 - ‰ΩøÁî®factorize

ÊúÄÂêéÔºåÂÜç‰ªãÁªç‰∏Ä‰∏™Â∞è‰ºó‰ΩÜÂ•ΩÁî®ÁöÑ`pandas`ÊñπÊ≥ïÔºåÊàë‰ª¨ÈúÄË¶ÅÊ≥®ÊÑèÂà∞ÔºåÂú®‰∏äÈù¢ÁöÑÊñπÊ≥ï‰∏≠ÔºåËá™Âä®ÁîüÊàêÁöÑ`Course Name_Label`ÂàóÔºåËôΩÁÑ∂‰∏Ä‰∏™Êï∞ÊçÆÂØπÂ∫î‰∏Ä‰∏™ËØ≠Ë®ÄÔºåÂõ†‰∏∫ÈÅøÂÖçÂÜôËá™ÂÆö‰πâÂáΩÊï∞ÊàñËÄÖÂ≠óÂÖ∏ÔºåËøôÊ†∑ÂèØ‰ª•Ëá™Âä®ÁîüÊàêÔºåÊâÄ‰ª•Â§ßÂ§öÊòØÊó†Â∫èÁöÑ„ÄÇ

Â¶ÇÊûúÊàë‰ª¨Â∏åÊúõÂÆÉÊòØÊúâÂ∫èÁöÑÔºå‰πüÂ∞±ÊòØ `Python` ÂØπÂ∫î `0`Ôºå`Java`ÂØπÂ∫î`1`ÔºåÈô§‰∫ÜËá™Â∑±ÊåáÂÆöÔºåËøòÊúâ‰ªÄ‰πà‰ºòÈõÖÁöÑÂäûÊ≥ïÔºüËøôÊó∂ÂèØ‰ª•‰ΩøÁî®`factorize`ÔºåÂÆÉ‰ºöÊ†πÊçÆÂá∫Áé∞È°∫Â∫èËøõË°åÁºñÁ†Å

In [166]:
df10 = df.copy()
df10['Course Name_Label'] = pd.factorize(df10['Course Name'])[0]
df10

      Sex Course Name  Score  Course Name_Label
0    Male      Python     95                  0
1  Female        Java     85                  1
2    Male           C     75                  2
3    Male         Sql     65                  3
4    Male       Linux     55                  4
5  Female      Python     95                  0
6    Male      Python     75                  0
7    Male        Java     65                  1
8  Female           C     55                  2
9  Female         Php     85                  5

ÁªìÂêàÂåøÂêçÂáΩÊï∞ÔºåÊàë‰ª¨ÂèØ‰ª•ÂÅöÂà∞ÂØπÂ§öÂàóËøõË°åÊúâÂ∫èÁºñÁ†ÅËΩ¨Êç¢

In [168]:
df10 = df.copy()
cat_columns = df10.select_dtypes(['object']).columns

df10[['Sex_Label', 'Course Name_Label']] = df10[cat_columns].apply(
    lambda x: pd.factorize(x)[0])
df10

      Sex Course Name  Score  Sex_Label  Course Name_Label
0    Male      Python     95          0                  0
1  Female        Java     85          1                  1
2    Male           C     75          0                  2
3    Male         Sql     65          0                  3
4    Male       Linux     55          0                  4
5  Female      Python     95          1                  0
6    Male      Python     75          0                  0
7    Male        Java     65          0                  1
8  Female           C     55          1                  2
9  Female         Php     85          1                  5

```{admonition} Ê≥®ÊÑè
:class: attention

‰Ω†Êó†ÈúÄÂÆåÂÖ®ËÆ∞‰ΩèÊâÄÊúâÊñπÊ≥ï‰∏éÁªÜËäÇÔºå**Âè™ÈúÄÁü•ÈÅìÊúâËøô‰πà‰∏™ÂáΩÊï∞ËÉΩÂÆåÊàêËøôÊ†∑Êìç‰ΩúÔºåÈúÄË¶ÅÁî®Êó∂ËÉΩÊÉ≥Âà∞ÔºåÊÉ≥Âà∞ÂÜçÊù•Êü•Â∞±Ë°å**„ÄÇ
```